## Поиск максимального числа в последовательности

### Описание
Написать программу, осуществляющую поиск наибольшего числа в последовательности из целых неотрицательных чисел. Последовательность задается на стандартный поток ввода stdin, элементы последовательности разделены между собой пробелом, концом последовательности является число -1, которое обозначает конец последовательности и не является ее элементом. Найденное наибольшее значение необходимо вывести на стандартный поток вывода stdout . Гарантируется, что в последовательности всегда есть хоть один элемент. В конце ответа не должно быть переноса на новую строку.

#### Дополнительные требования
1. Ввод - `stdin`, вывод - `stdout`.
2. Проверка корректности ввода. В случае некорректности ввода выводить "n/a".
3. В конце вывода не должно быть переноса строки.

### Примеры входных и выходных данных

| Входные данные       | Выходные данные   |
|----------------------|-------------------|
| `1 2 3 4 5 -1`       | `5`               |
| `1 -1`               | `1`               |
| `5 9 9 1 5 9 9 5 -1` | `9`               |


### Решения
Сначала попробуй самостоятельно решить :)

<details>
<summary>C</summary>

```c
#include <stdio.h>
#include <limits.h>

int main()
{
  int max = INT_MIN;
  int num = INT_MIN;

  while (num != -1) {
    if (scanf("%d", &num) != 1) {
      printf("n/a");
      return 1;
    }

    if (num > max) max = num;
  }

  printf("%d", max);

  return 0;
}
```

</details>
