## Масса шара из серебра

### Описание
Написать программу, которая будет получать на ввод целое неотрицательное число - радиус шара, и по этому значению рассчитывать массу, округлять до целого числа результат и выводить его.

#### Дополнительные требования
1. Проверка корректности ввода. В случае некорректности ввода выводить "n/a".
2. Важна точность рассчётов, поэтому для $\pi$ используй `M_PI`, а для округления `round()` из `math.h`. Для вещественных числе тип `double`.
3. Ввод - `stdin`, вывод - `stdout`.

### Предметная область
#### Плотность серебра

$$10500 \frac{кг}{м^3}$$

#### Объёма шара

$$V = \frac{4}{3} * \pi * r^3$$

#### Плотность шара (нужно преобразовать это уравнение, чтобы получить формулу массы):

$$P = \frac{m}{V}$$

### Примеры входных и выходных данных

| Входные данные | Выходные данные |
|----------------|-----------------|
| 1              | 43983           |
| 2              | 351858          |
| 10             | 43982297        |
| -1             | n/a             |
| 0              | 0               |

### Решения
Сначала попробуй самостоятельно решить :)

<details>
<summary>C</summary>

```c
#include <stdio.h>
#include <math.h>

#define SILVER_DENSITY 10500

int main() {
  int radius;
  if (scanf("%d", &radius) != 1 || radius < 0) {
    printf("n/a");
    return 1;
  }

  double volume = (4.0 / 3.0) * M_PI * pow(radius, 3);
  double mass = volume * SILVER_DENSITY;

  printf("%.0f", round(mass));

  return 0;
}
```

</details>
